import './style.css'
import ShapesObjectsEditor from './ShapesObjectsEditor.ts'


/**
 *  @todo
 *  [x] Гумовий" слід - суцільна лінія червоного кольору
 *  [x] Увід прямокутника - від центру до одного з кутів для, чорний контур без заповнення
 *  [x] Увід еліпса по двом протилежним кутам охоплюючого прямокутника для, колір - чорний контур з жовтим заповненням
 *  [x] Позначка поточного типу об'єкту що вводиться в заголовку вікна
 *  [x] Додати тулбар з картинками фігур, що вводяться
 */


const lab2 = new ShapesObjectsEditor();
